
kabuka = {
 'ソフトバンク': {
 '20160301134528': 3428374289375,
 '20160301134529': 3472983798268,
 '20160301134530': 3582978789437,
 '20160301134531': 3437289785723
 },
 'リクルート': {
 '20160301134528': 2797374289375,
 '20160301134529': 2847283798268,
 '20160301134530': 2982978789437,
 '20160301134531': 2337289785723
 }
}

for company, data in kabuka.items():
  print(company)
  sum = 0
  for time, value in data.items():
    print(value)
    sum += value
  avg = sum / len(data)
  print('合計は、{}'.format(sum))
  print('平均は,{}'.format(avg))
